In [2]:
import pandas as pd

obesity_data = pd.read_csv('obseity_prediction.csv')
obesity_data.head()

,Gender,Age,Height,Weight,family_history,FAVC,FCVC,NCP,CAEC,SMOKE,CH2O,SCC,FAF,TUE,CALC,MTRANS,Obesity
0,Female,21.0,1.62,64.0,yes,no,2.0,3.0,Sometimes,no,2.0,no,0.0,1.0,no,Public_Transportation,Normal_Weight
1,Female,21.0,1.52,56.0,yes,no,3.0,3.0,Sometimes,yes,3.0,yes,3.0,0.0,Sometimes,Public_Transportation,Normal_Weight
2,Male,23.0,1.80,77.0,yes,no,2.0,3.0,Sometimes,no,2.0,no,2.0,1.0,Frequently,Public_Transportation,Normal_Weight
3,Male,27.0,1.80,87.0,no,no,3.0,3.0,Sometimes,no,2.0,no,2.0,0.0,Frequently,Walking,Overweight_Level_I
4,Male,22.0,1.78,89.8,no,no,2.0,1.0,Sometimes,no,2.0,no,0.0,0.0,Sometimes,Public_Transportation,Overweight_Level_II

In [3]:
## joins means combing data frames
df1=pd.DataFrame({
    'id':[1,2,3,4],
    "name":['mohammed','yasir','arfat','fdoyhdbn'],

})
df2=pd.DataFrame({
    'id':[1,2,3,4],
    "course":['DSA','DBMS','OS','JS'],
    
})
inner_res=pd.merge(df1,df2,how='inner',on='id')
inner_res

   id      name course
0   1  mohammed    DSA
1   2     yasir   DBMS
2   3     arfat     OS
3   4  fdoyhdbn     JS

In [4]:
df2=pd.DataFrame({
    'id':[1,2,3,4,5,6],
    "course":['DSA','DBMS','OS','JS','devops','ai'],
    
})

In [5]:
outer_res=pd.merge(df1,df2,how='outer',on='id')
outer_res

   id      name  course
0   1  mohammed     DSA
1   2     yasir    DBMS
2   3     arfat      OS
3   4  fdoyhdbn      JS
4   5       NaN  devops
5   6       NaN      ai

In [6]:
left_res=pd.merge(df1,df2,how='left',on='id')
left_res

   id      name course
0   1  mohammed    DSA
1   2     yasir   DBMS
2   3     arfat     OS
3   4  fdoyhdbn     JS

In [7]:
## no common label
df3=pd.DataFrame({
    'id1':[1,2,3,4],
    "name":['mohammed','yasir','arfat','fdoyhdbn'],

})
df4=pd.DataFrame({
    'id2':[1,2,3,4],
    "course":['DSA','DBMS','OS','JS'],
    
})

res=pd.merge(df3,df4,how='inner',left_on='id1',right_on='id2')
res

   id1      name  id2 course
0    1  mohammed    1    DSA
1    2     yasir    2   DBMS
2    3     arfat    3     OS
3    4  fdoyhdbn    4     JS

In [16]:
df3=pd.DataFrame({
    'id1':[1,2,3,4],
    "name":['mohammed','yasir','arfat','fdoyhdbn'],

})
df4=pd.DataFrame({
    'id2':[1,2,3,4],
    "course":['DSA','DBMS','OS','JS'],
    
})

res=pd.concat([df1,df2],axis=0,ignore_index=True)
res

   id      name course
0   1  mohammed    NaN
1   2     yasir    NaN
2   3     arfat    NaN
3   4  fdoyhdbn    NaN
4   1       NaN    DSA
5   2       NaN   DBMS
6   3       NaN     OS
7   4       NaN     JS

In [8]:
res=pd.concat([df1,df2],axis=1,ignore_index=True)
res

     0         1  2       3
0  1.0  mohammed  1     DSA
1  2.0     yasir  2    DBMS
2  3.0     arfat  3      OS
3  4.0  fdoyhdbn  4      JS
4  NaN       NaN  5  devops
5  NaN       NaN  6      ai

In [18]:
res=pd.concat([df1,df2],axis=0,keys=['df3','df4'])
res

       id      name course
df3 0   1  mohammed    NaN
    1   2     yasir    NaN
    2   3     arfat    NaN
    3   4  fdoyhdbn    NaN
df4 0   1       NaN    DSA
    1   2       NaN   DBMS
    2   3       NaN     OS
    3   4       NaN     JS

In [9]:
res1=pd.concat([df1,df2],axis=0,ignore_index=True)
res1

   id      name  course
0   1  mohammed     NaN
1   2     yasir     NaN
2   3     arfat     NaN
3   4  fdoyhdbn     NaN
4   1       NaN     DSA
5   2       NaN    DBMS
6   3       NaN      OS
7   4       NaN      JS
8   5       NaN  devops
9   6       NaN      ai

In [20]:
## detect null values
res1.isna()

      id   name  course
0  False  False    True
1  False  False    True
2  False  False    True
3  False  False    True
4  False   True   False
5  False   True   False
6  False   True   False
7  False   True   False

In [10]:
res1.notna()

     id   name  course
0  True   True   False
1  True   True   False
2  True   True   False
3  True   True   False
4  True  False    True
5  True  False    True
6  True  False    True
7  True  False    True
8  True  False    True
9  True  False    True

In [26]:
res1.isna().sum()

id        0
name      4
course    4
dtype: int64

In [11]:
obesity_data.head()

,Gender,Age,Height,Weight,family_history,FAVC,FCVC,NCP,CAEC,SMOKE,CH2O,SCC,FAF,TUE,CALC,MTRANS,Obesity
0,Female,21.0,1.62,64.0,yes,no,2.0,3.0,Sometimes,no,2.0,no,0.0,1.0,no,Public_Transportation,Normal_Weight
1,Female,21.0,1.52,56.0,yes,no,3.0,3.0,Sometimes,yes,3.0,yes,3.0,0.0,Sometimes,Public_Transportation,Normal_Weight
2,Male,23.0,1.80,77.0,yes,no,2.0,3.0,Sometimes,no,2.0,no,2.0,1.0,Frequently,Public_Transportation,Normal_Weight
3,Male,27.0,1.80,87.0,no,no,3.0,3.0,Sometimes,no,2.0,no,2.0,0.0,Frequently,Walking,Overweight_Level_I
4,Male,22.0,1.78,89.8,no,no,2.0,1.0,Sometimes,no,2.0,no,0.0,0.0,Sometimes,Public_Transportation,Overweight_Level_II

In [12]:
import numpy as np
obesity_data.loc[0,'Age']=np.nan
obesity_data.loc[0,'SMOKE']=np.nan
obesity_data.loc[1,'Age']=np.nan

In [13]:
obesity_data.head()

,Gender,Age,Height,Weight,family_history,FAVC,FCVC,NCP,CAEC,SMOKE,CH2O,SCC,FAF,TUE,CALC,MTRANS,Obesity
0,Female,NaN,1.62,64.0,yes,no,2.0,3.0,Sometimes,NaN,2.0,no,0.0,1.0,no,Public_Transportation,Normal_Weight
1,Female,NaN,1.52,56.0,yes,no,3.0,3.0,Sometimes,yes,3.0,yes,3.0,0.0,Sometimes,Public_Transportation,Normal_Weight
2,Male,23.0,1.80,77.0,yes,no,2.0,3.0,Sometimes,no,2.0,no,2.0,1.0,Frequently,Public_Transportation,Normal_Weight
3,Male,27.0,1.80,87.0,no,no,3.0,3.0,Sometimes,no,2.0,no,2.0,0.0,Frequently,Walking,Overweight_Level_I
4,Male,22.0,1.78,89.8,no,no,2.0,1.0,Sometimes,no,2.0,no,0.0,0.0,Sometimes,Public_Transportation,Overweight_Level_II

In [14]:
obesity_data.fillna(0,inplace=True)

In [15]:
obesity_data.head()

,Gender,Age,Height,Weight,family_history,FAVC,FCVC,NCP,CAEC,SMOKE,CH2O,SCC,FAF,TUE,CALC,MTRANS,Obesity
0,Female,0.0,1.62,64.0,yes,no,2.0,3.0,Sometimes,0,2.0,no,0.0,1.0,no,Public_Transportation,Normal_Weight
1,Female,0.0,1.52,56.0,yes,no,3.0,3.0,Sometimes,yes,3.0,yes,3.0,0.0,Sometimes,Public_Transportation,Normal_Weight
2,Male,23.0,1.80,77.0,yes,no,2.0,3.0,Sometimes,no,2.0,no,2.0,1.0,Frequently,Public_Transportation,Normal_Weight
3,Male,27.0,1.80,87.0,no,no,3.0,3.0,Sometimes,no,2.0,no,2.0,0.0,Frequently,Walking,Overweight_Level_I
4,Male,22.0,1.78,89.8,no,no,2.0,1.0,Sometimes,no,2.0,no,0.0,0.0,Sometimes,Public_Transportation,Overweight_Level_II

In [16]:
obesity_data.loc[0,'Age']=np.nan
obesity_data.loc[0,'SMOKE']=np.nan
obesity_data.loc[1,'Age']=np.nan

In [46]:
obesity_data['Age'].fillna(obesity_data['Age'].mean(),inplace=True)

C:\Users\mehsa\AppData\Local\Temp\ipykernel_10880\4215811637.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  obesity_data['Age'].fillna(obesity_data['Age'].mean(),inplace=True)

In [17]:
obesity_data.head()

,Gender,Age,Height,Weight,family_history,FAVC,FCVC,NCP,CAEC,SMOKE,CH2O,SCC,FAF,TUE,CALC,MTRANS,Obesity
0,Female,NaN,1.62,64.0,yes,no,2.0,3.0,Sometimes,NaN,2.0,no,0.0,1.0,no,Public_Transportation,Normal_Weight
1,Female,NaN,1.52,56.0,yes,no,3.0,3.0,Sometimes,yes,3.0,yes,3.0,0.0,Sometimes,Public_Transportation,Normal_Weight
2,Male,23.0,1.80,77.0,yes,no,2.0,3.0,Sometimes,no,2.0,no,2.0,1.0,Frequently,Public_Transportation,Normal_Weight
3,Male,27.0,1.80,87.0,no,no,3.0,3.0,Sometimes,no,2.0,no,2.0,0.0,Frequently,Walking,Overweight_Level_I
4,Male,22.0,1.78,89.8,no,no,2.0,1.0,Sometimes,no,2.0,no,0.0,0.0,Sometimes,Public_Transportation,Overweight_Level_II

In [18]:
obesity_data.dropna()

,Gender,Age,Height,Weight,family_history,FAVC,FCVC,NCP,CAEC,SMOKE,CH2O,SCC,FAF,TUE,CALC,MTRANS,Obesity
2,Male,23.000000,1.800000,77.000000,yes,no,2.0,3.0,Sometimes,no,2.000000,no,2.000000,1.000000,Frequently,Public_Transportation,Normal_Weight
3,Male,27.000000,1.800000,87.000000,no,no,3.0,3.0,Sometimes,no,2.000000,no,2.000000,0.000000,Frequently,Walking,Overweight_Level_I
4,Male,22.000000,1.780000,89.800000,no,no,2.0,1.0,Sometimes,no,2.000000,no,0.000000,0.000000,Sometimes,Public_Transportation,Overweight_Level_II
5,Male,29.000000,1.620000,53.000000,no,yes,2.0,3.0,Sometimes,no,2.000000,no,0.000000,0.000000,Sometimes,Automobile,Normal_Weight
6,Female,23.000000,1.500000,55.000000,yes,yes,3.0,3.0,Sometimes,no,2.000000,no,1.000000,0.000000,Sometimes,Motorbike,Normal_Weight
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2106,Female,20.976842,1.710730,131.408528,yes,yes,3.0,3.0,Sometimes,no,1.728139,no,1.676269,0.906247,Sometimes,Public_Transportation,Obesity_Type_III
2107,Female,21.982942,1.748584,133.742943,yes,yes,3.0,3.0,Sometimes,no,2.005130,no,1.341390,0.599270,Sometimes,Public_Transportation,Obesity_Type_III
2108,Female,22.524036,1.752206,133.689352,yes,yes,3.0,3.0,Sometimes,no,2.054193,no,1.414209,0.646288,Sometimes,Public_Transportation,Obesity_Type_III
2109,Female,24.361936,1.739450,133.346641,yes,yes,3.0,3.0,Sometimes,no,2.852339,no,1.139107,0.586035,Sometimes,Public_Transportation,Obesity_Type_III
2110,Female,23.664709,1.738836,133.472641,yes,yes,3.0,3.0,Sometimes,no,2.863513,no,1.026452,0.714137,Sometimes,Public_Transportation,Obesity_Type_III

In [20]:
obesity_data.dropna(inplace=True)
obesity_data.head()

,Gender,Age,Height,Weight,family_history,FAVC,FCVC,NCP,CAEC,SMOKE,CH2O,SCC,FAF,TUE,CALC,MTRANS,Obesity
2,Male,23.0,1.80,77.0,yes,no,2.0,3.0,Sometimes,no,2.0,no,2.0,1.0,Frequently,Public_Transportation,Normal_Weight
3,Male,27.0,1.80,87.0,no,no,3.0,3.0,Sometimes,no,2.0,no,2.0,0.0,Frequently,Walking,Overweight_Level_I
4,Male,22.0,1.78,89.8,no,no,2.0,1.0,Sometimes,no,2.0,no,0.0,0.0,Sometimes,Public_Transportation,Overweight_Level_II
5,Male,29.0,1.62,53.0,no,yes,2.0,3.0,Sometimes,no,2.0,no,0.0,0.0,Sometimes,Automobile,Normal_Weight
6,Female,23.0,1.50,55.0,yes,yes,3.0,3.0,Sometimes,no,2.0,no,1.0,0.0,Sometimes,Motorbike,Normal_Weight

In [22]:
obesity_data.groupby('Gender')['Height'].count()

Gender
Female    1041
Male      1068
Name: Height, dtype: int64

In [23]:
obesity_data.groupby('Gender')['Height'].mean()

Gender
Female    1.643439
Male      1.758690
Name: Height, dtype: float64

In [24]:
obesity_data.groupby('Gender')['Height'].median()

Gender
Female    1.64
Male      1.76
Name: Height, dtype: float64

In [25]:
obesity_data.groupby('Gender').count()

,Age,Height,Weight,family_history,FAVC,FCVC,NCP,CAEC,SMOKE,CH2O,SCC,FAF,TUE,CALC,MTRANS,Obesity
Gender,,,,,,,,,,,,,,,,
Female,1041,1041,1041,1041,1041,1041,1041,1041,1041,1041,1041,1041,1041,1041,1041,1041
Male,1068,1068,1068,1068,1068,1068,1068,1068,1068,1068,1068,1068,1068,1068,1068,1068